import math
# Напишите программу, которая принимает на вход цифру, обозначающую
# день недели, и проверяет, является ли этот день выходным.
# Пример:
# - 6 -> да
# - 7 -> да
# - 1 -> нет

# ============================================================
# n = int(input('Введите число: '))
# if n % 6 == 0 or n % 7 == 0:
#     print("да")
# else:
#     print('нет')
# ============================================================

# Напишите программу для. проверки истинности утверждения
# ¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z для всех значений предикат.
# =========================================================================
# for X in range(2):
#     for Y in range(2):
#         for Z in range(2):
#             bool = not (X or Y or Z) == (not (X)) and not (Y) and not (Z)
#             print(f'{X} {Y} {Z} = {bool}')
# ==============================================================================

# Напишите программу, которая принимает на вход координаты точки
# (X и Y), причём X ≠ 0 и Y ≠ 0 и выдаёт номер четверти плоскости,
# в которой находится эта точка (или на какой оси она находится).
# Пример:
# - x=34; y=-30 -> 4
# - x=2; y=4-> 1
# - x=-34; y=-30 -> 3
# =================================================================================
# X = int(input('Введите координату Х: '))
# Y = int(input('Введите координату Y: '))

# if X > 0 and Y > 0:
#     print(1)
# if X < 0 and Y > 0:
#     print(2)
# if X < 0 and Y < 0:
#     print(3)
# if X > 0 and Y < 0:
#     print(4)
# ====================================================================================

# Напишите программу, которая по заданному номеру четверти, показывает диапазон
#  возможных координат точек в этой четверти (x и y).
# ====================================================================================

# X = int(input('Введите номер четверти: '))
# if X == 1:
#     print("X > 0 and Y > 0")
# if X == 2:
#     print("X < 0 and Y > 0")
# if X == 3:
#     print("X < 0 and Y < 0")
# if X == 4:
#     print("X > 0 and Y < 0")
# ====================================================================================

# Напишите программу, которая принимает на вход координаты двух точек и находит
# расстояние между ними в 2D пространстве.
# Пример:
# - A (3,6); B (2,1) -> 5,09
# - A (7,-5); B (1,-1) -> 7,21
# ====================================================================================


ax = int(input('Введите координату ax: '))
ay = int(input('Введите координату ay: '))
bx = int(input('Введите координату bx: '))
by = int(input('Введите координату by: '))

res = math.sqrt(((bx - ax) ** 2) + ((by - ay) ** 2))
print(f'A({ax}, {ay}); B({bx}, {by}) -> {res}')
# ====================================================================================
