# Задайте список из нескольких чисел. Напишите программу, которая
# найдёт сумму элементов списка, стоящих на нечётной позиции.
# Пример:
# - [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12
# -----------------------------------------------------------------------------
# arr = [2, 3, 5, 9, 3, 9, 4]
# amound = 0
# for i in range(0, len(arr)):
#     if(i % 2 != 0):
#         amound += arr[i]
# print(amound)
# -----------------------------------------------------------------------------
# Напишите программу, которая найдёт произведение пар чисел списка.
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# Пример:
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]
# -----------------------------------------------------------------------------
# arr = [2, 3, 5, 9, 3]
# mult = []
# j = len(arr) - 1
# for i in range(int(len(arr)/2+1)):
#      mult.append(arr[i] * arr[j])
#      j -= 1
# print(mult)
# -----------------------------------------------------------------------------
# Задайте список из вещественных чисел. Напишите программу, которая найдёт
# разницу между максимальным и минимальным значением дробной части элементов.
# Пример:
# - [1.1, 1.2, 3.1, 5, 10.01] => 0.19
# -----------------------------------------------------------------------------
# arr = [1.1, 1.2, 3.1, 5, 10.01]
# min = 100
# max = -100
# temp = []
# for i in range(len(arr)):
#     temp.append(arr[i] - int(arr[i]))
#     if(temp[i] == 0):
#         continue
#     if(temp[i] > max):
#         max = temp[i]
#     if(temp[i] < min):
#         min = temp[i]
# print(max - min)
# -----------------------------------------------------------------------------
# Напишите программу, которая будет преобразовывать десятичное число в двоичное.
# Пример:
# - 45 -> 101101
# - 3 -> 11
# - 2 -> 10
# -----------------------------------------------------------------------------
# num = int(input('введите Число: '))
# print(bin(num))
# numb = ''
# while num > 0:
#     numb = str(num % 2) + numb
#     num = num // 2
# print(numb)
# -----------------------------------------------------------------------------
#
# Задайте число. Составьте список чисел Фибоначчи, в том числе для отрицательных индексов.
# Пример:

n = int(input('Введите число: '))

def get_fibonacci(n):
    fibo_nums = []
    a, b = 1, 1
    for i in range(n-1):
        fibo_nums.append(a)
        a, b = b, a + b
    a, b = 0, 1
    for i in range (n):
        fibo_nums.insert(0, a)
        a, b = b, a - b
    return fibo_nums

fibo_nums = get_fibonacci(n)
print(get_fibonacci(n))
print(fibo_nums.index(0))